
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СписокВопросов = Новый СписокЗначений();
	
	Для Каждого Вопрос из ПараметрКоманды Цикл
		Если ЗначениеЗаполнено(Вопрос) И НЕ ОбъектЯвляетсяГруппой(Вопрос) Тогда
			СписокВопросов.Добавить(Вопрос);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокВопросов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Не выбраны вопросы для добавления'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("СписокВопросов", СписокВопросов);
	ИмяФормы = "ПланВидовХарактеристик.ВопросыПоТехническимПроектам.Форма.ДобавлениеВопросовВТехническиеПроекты";
	ОткрытьФорму(ИмяФормы, ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,,,, Неопределено);
	
КонецПроцедуры

&НаСервере
Функция ОбъектЯвляетсяГруппой(Ссылка)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВопросыПоТехническимПроектам.ЭтоГруппа
	|ИЗ
	|	ПланВидовХарактеристик.ВопросыПоТехническимПроектам КАК ВопросыПоТехническимПроектам
	|ГДЕ
	|	ВопросыПоТехническимПроектам.Ссылка = &Ссылка"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ЭтоГруппа;
	
КонецФункции
