#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользуемыеВИБВидыСогласуемыхРесурсов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыСогласуемыхРесурсов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыСогласуемыхРесурсов КАК ВидыСогласуемыхРесурсов
	|ГДЕ
	|	НЕ ВидыСогласуемыхРесурсов.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ОсновнойВидСогласуемогоРесурса() Экспорт
	
	Возврат Справочники.ВидыСогласуемыхРесурсов.ОсновнойВидСогласуемогоРесурса();
	
КонецФункции

Функция ПредставлениеВидаРесурса(ВидРесурса) Экспорт
	
	Возврат Справочники.ВидыСогласуемыхРесурсов.ПредставлениеВидаРесурса(ВидРесурса);
	
КонецФункции

#КонецОбласти