////////////////////////////////////////////////////////////////////////////////
//  Серверные процедуры и функции подсистемы "Задачи процессов", доступные для вызова с клиента
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьДействиеНадМассивомЗадач(МассивЗадач, Действие, КоличествоОбработанных, ДополнительныеПараметры) Экспорт

	Если Действие = "ВыполнитьЗадачу" Тогда
		
		ЗадачиПроцессов.ПеревестиЗадачиНаНовыйСтатус(МассивЗадач, Перечисления.СтатусыЗадачПроцессов.Выполнена, КоличествоОбработанных);
		
	ИначеЕсли Действие = "Перенаправить" Тогда
		
		ЗадачиПроцессов.ПеренаправитьЗадачи(МассивЗадач, КоличествоОбработанных, ДополнительныеПараметры);
		
	ИначеЕсли Действие = "НаправитьИсполнителямЗадачи" Тогда
		
		ЗадачиПроцессов.НаправитьИсполнителямЗадачи(МассивЗадач, КоличествоОбработанных, ДополнительныеПараметры);
		
	ИначеЕсли Действие = "Запланировать" Тогда
		
		ЗадачиПроцессов.ПеревестиЗадачиНаНовыйСтатус(МассивЗадач, Перечисления.СтатусыЗадачПроцессов.Запланирована, КоличествоОбработанных);
		
	ИначеЕсли Действие = "ПринятьКВыполнению" Тогда
		
		ЗадачиПроцессов.ПеревестиЗадачиНаНовыйСтатус(МассивЗадач, Перечисления.СтатусыЗадачПроцессов.ПринятаКВыполнению, КоличествоОбработанных);
		
	ИначеЕсли Действие = "НаправитьНаПроверку" Тогда
		
		ЗадачиПроцессов.НаправитьЗадачиНаПроверку(МассивЗадач, Перечисления.СтатусыЗадачПроцессов.ПринятаКВыполнению, КоличествоОбработанных);
		
	ИначеЕсли Действие = "НаправитьНаСогласование" Тогда
		
		ЗадачиПроцессов.НаправитьНаСогласование(МассивЗадач, ДополнительныеПараметры.СогласуемыйРесурс, КоличествоОбработанных);
		
	ИначеЕсли Действие = "Согласовать" Тогда
		
		ЗадачиПроцессов.СогласоватьРесурсМассиваЗадач(МассивЗадач, ДополнительныеПараметры.СогласуемыйРесурс, КоличествоОбработанных);
		
	ИначеЕсли Действие = "ИзменитьИсполнителя" Тогда
		
		ЗадачиПроцессов.ИзменитьИсполнителяЗадач(МассивЗадач, ДополнительныеПараметры, КоличествоОбработанных);
		
	ИначеЕсли Действие = "Ознакомиться" Тогда
		
		ЗадачиПроцессов.ОзнакомитьсяСЗадачами(МассивЗадач, КоличествоОбработанных);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПеренаправитьЗадачу(Параметры) Экспорт
	
	ЗадачиПроцессов.ПеренаправитьЗадачу(Параметры);
	
КонецПроцедуры

Процедура НеСогласоватьРесурс(Параметры) Экспорт
	
	ЗадачиПроцессов.НеСогласоватьРесурс(Параметры);
	
КонецПроцедуры

Процедура ЧастичноСогласоватьРесурс(Параметры) Экспорт
	
	ЗадачиПроцессов.ЧастичноСогласоватьРесурс(Параметры);
	
КонецПроцедуры

Функция ДанныеВидаРесурсаПоКоду(КодСогласуемогоРесурса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидыСогласуемыхРесурсов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВидыСогласуемыхРесурсов.Ссылка           КАК Ссылка,
	|	ВидыСогласуемыхРесурсов.Наименование     КАК Наименование,
	|	НЕОПРЕДЕЛЕНО                             КАК Согласующий
	|ИЗ
	|	Справочник.ВидыСогласуемыхРесурсов КАК ВидыСогласуемыхРесурсов
	|ГДЕ
	|	ВидыСогласуемыхРесурсов.Код = &КодСогласуемогоРесурса";
	
	Запрос.УстановитьПараметр("КодСогласуемогоРесурса", КодСогласуемогоРесурса);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
	СтруктураВозврата.Вставить("Ссылка",           Выборка.Ссылка );
	СтруктураВозврата.Вставить("Наименование",     Выборка.Наименование );
	СтруктураВозврата.Вставить("Согласующий",      Выборка.Согласующий );
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция РезультатИзмененияРодителяУМассиваЗадач(МассивЗадачКПеретаскиванию, НовыйРодитель) Экспорт

	Возврат ЗадачиПроцессов.РезультатИзмененияРодителяУМассиваЗадач(МассивЗадачКПеретаскиванию, НовыйРодитель);

КонецФункции

#КонецОбласти